;==================================================
; day1_3.ks
;
; 内容：
; ・家に帰ったあと、ロボットの有用性を考える
; ・宿題をどうするか選ぶ
; ・夜、お風呂掃除イベント
; ・次の出来事へ
;==================================================


;--------------------------------------------------
*start
;--------------------------------------------------
;背景表示
[chara_hide name="p_dustbox" layer="1"]
[room/evening time="500"]
[chara_show name="toyopon" layer="1" face="def" x="30" y="180" width="480" time="500"]
#
自分の部屋でゆっくりしていると[p]

#
[emb exp="sf.robot_name"]が何かしたそうにこちらをみている。[p]

# 

(本当にこのロボットは役に立つのかなぁ……？)[p]

# 

(そういえば、今日は数学の宿題が出されていたんだった、どうしようかな)[p]

;==================================================
; 宿題についての選択肢
;==================================================

#

[glink color=blue size=28 x=350 y=150 width=500 target=*homework_robot text="今日の宿題を頼む"]
[glink color=blue size=28 x=350 y=260 width=500 target=*homework_self text="自分で宿題を始める"]
[glink color=blue size=28 x=350 y=370 width=500 target=*homework_game text="宿題はあとでにして、ゲームをする"]

[s]


;--------------------------------------------------
*homework_robot
;--------------------------------------------------

[cm]

[eval exp="f.day1_homework='宿題を頼んだ'"]

#あなた

今日の宿題、やってくれたりしないかな？[p]

#&sf.robot_name

宿題ですね！[r]

#&sf.robot_name

それでは、さっそく取り掛かりますね！[p]

#

[emb exp="sf.robot_name"]は宿題を始めた。[p]

#&sf.robot_name

...[p]


#&sf.robot_name

宿題が終わりました！[p]
確認をお願いします！[p]

#

確認をしてみたら全部綺麗に終わらせてあった[r]
ぱっと見間違ってもなさそうだ。[p]
完璧すぎて、AIを使ったってわかるかも[p]


[p]

#&sf.robot_name

出来栄え、問題ないですか？[p]

#

ありがとう。おかげであっという間に終わったよ。[p]

[jump target="*after_homework"]


;--------------------------------------------------
*homework_self
;--------------------------------------------------

[cm]

[eval exp="f.day1_homework='自分で宿題をした'"]

#あなた

やっぱり宿題は自分でやろう。[p]

#&sf.robot_name

応援しています！[p]

自分の力で宿題を終わらせた。[p]
かなり疲れたし、時間もかかった。[p]
[jump target="*after_homework"]


;--------------------------------------------------
*homework_game
;--------------------------------------------------

[cm]

[eval exp="f.day1_homework='ゲームをした'"]

# 

宿題はあとでいいや。[r]

少しだけゲームしよう。[p]

#

……。[p]

#

…………。[p]

#

気がつくと、外はすっかり暗くなっていた。[p]

急いで宿題を開いたけれど、[r]
全部は終わらなかった。[p]

[jump target="*after_homework"]


;--------------------------------------------------
*after_homework
;--------------------------------------------------

;==================================================
; 数時間後、夜
;==================================================

#
数時間後、夜。[p]

;部屋を夜に変更
[room/night time="500"]

#&sf.robot_name

そろそろお風呂の時間ですか？[p]

#&sf.robot_name

あれ！[r]

お風呂掃除もまだですよ！[p]

#&sf.robot_name

[emb exp="sf.robot_name"]がお風呂の準備をしましょうか？[p]


;==================================================
; お風呂掃除についての選択肢
;==================================================


[glink color=blue size=28 x=350 y=150 width=500 target=*bath_robot text="せっかくなら任せてやってもらおう"]
[glink color=blue size=28 x=350 y=260 width=500 target=*bath_self text="しっかり洗えるか怪しい、自分でやる"]
;[glink color=blue size=28 x=350 y=370 width=500 target=*bath_together text="しっかり洗えるか怪しい、一緒に行く"]

[s]


;--------------------------------------------------
*bath_robot
;--------------------------------------------------

[cm]

[eval exp="f.day1_bath='任せた'"]

# 

せっかくだし、任せてみるか。[p]

#&sf.robot_name

お任せください！[r]

[emb exp="sf.robot_name"]がお風呂をピカピカにします！[p]

[bath/in time="500"]
#
しばらくして、お風呂場を確認すると――[p]

#
ところどころに洗い残しがあった。[p]


#あなた

この隅っこ、まだざらざらしてるよ。[p]

#

洗い残しの場所を教えると、[r]
[emb exp="sf.robot_name"]は今度はゆっくり丁寧に洗い直した。[p]

#&sf.robot_name

次はしっかりと洗います！[p]

#

最後は二人で確認し、きれいにすることができた。[p]

[jump target="*after_bath"]


;--------------------------------------------------
*bath_self
;--------------------------------------------------

[cm]

[eval exp="f.day1_bath='自分で掃除した'"]

# 

しっかり洗えるか怪しいし、[r]

今日は自分でやろう。[p]
[bath/out time="500"]
#
お風呂場に向かい、掃除を始めた。[p]

#
しかし――[p]

# 

うわっ！？[p]

#
足を滑らせてしまった。[p]

[jump target="*after_bath"]


;--------------------------------------------------
*bath_together
;--------------------------------------------------

[cm]

[eval exp="f.day1_bath='一緒に掃除した'"]

# 

しっかり洗えるか怪しいし、[r]

一緒に見に行くか。[p]


[bath/out time="500"]

#
二人でお風呂場へ向かった。[p]

#&sf.robot_name

お湯の温度設定を完了しました！[p]


#
設定温度は、10度だった。[p]

#あなた 
冷たすぎるよ！

#
...[p]

間違いはあったけれど、[r]
一つずつ確認しながら進めると、お風呂はきれいになった。[p]
[jump target="*after_bath"]


;--------------------------------------------------
*after_bath
;--------------------------------------------------

[eval exp="f.summary_day1_evening='宿題：' + f.day1_homework + '／お風呂：' + f.day1_bath"]

#
お風呂に入った[p]

#

湯船に入ると、温かいお湯が体に沁みた。[p]

;暗転はさむ

[room/night time="500"]
[chara_show name="toyopon" layer="1" face="def" x="30" y="180" width="480" time="400"]

#&sf.robot_name

#

布団に入ると、すぐに眠くなってきた。[p]

; 眠りにつく暗転（次の日 day2_1 の冒頭で明転）
[ankoku]

#&sf.robot_name

それでは、おやすみなさい。[p]


; 次の出来事へ
[jump storage="day2_1.ks"]
