;==================================================
; day2_3.ks
;
; 内容：
; ・夕方、家に帰ってくる
; ・nameが学校について聞く
; ・nameが読み聞かせの練習をお願いする
; ・次の出来事 day2_4.ks へ
;==================================================


;--------------------------------------------------
*start
;--------------------------------------------------

#
夕方。[p]

#
家に帰ってきた。[p]

#name
お帰りなさい！[p]

#name
学校は楽しかったですか？[p]


;==================================================
; 学校は楽しかった？
;==================================================

どう答えますか？[p]

[link target="school_fun"]楽しい[endlink][r]
[link target="school_normal"]普通[endlink][r]
[link target="school_not_fun"]楽しくない！[endlink][s]


;--------------------------------------------------
*school_fun
;--------------------------------------------------

#あなた
楽しいよ[p]

#name
やっぱり！[p]

[jump target="after_school_answer"]


;--------------------------------------------------
*school_normal
;--------------------------------------------------

#あなた
普通かな。[p]



[jump target="after_school_answer"]


;--------------------------------------------------
*school_not_fun
;--------------------------------------------------

#あなた
楽しくない！[p]

#name
ええー！そうですか[p]
[jump target="after_school_answer"]


;--------------------------------------------------
*after_school_answer
;--------------------------------------------------

#name
実はぼくは、子どもたちと[r]
関わるのが好きで、[r]
学校に憧れているんです！[p]

#name
そこで、お願いがあるんだ。[p]

#name
読み聞かせの練習を[r]
手伝ってほしい！[p]


;==================================================
; 読み聞かせの練習を手伝う？
;==================================================

どうしますか？[p]

[link target="reading"]喜んで手伝う[endlink][r]
[link target="reading"]しょうがなく手伝う[endlink][r]
[link target="reading"]本当に本当にしょうがなく手伝う[endlink][s]


;--------------------------------------------------
*reading
;--------------------------------------------------

#あなた
手伝うよ[p]

#name
本当ですか！[r]
ありがとうございます！[p]

#name
それじゃあ、さっそく始めますね！[p]

#
読み聞かせは省略[p]
[jump target="after_reading"]




;--------------------------------------------------
*after_reading
;--------------------------------------------------

#
読み聞かせの練習を手伝った。[p]


; 次の出来事へ
;
[jump storage="day2_4.ks"]